{
  "task_name": "Father's Day gifts (recommend/compare/reviews)",
  "meta_tool": "Father's Day gifts (recommend/compare/reviews)",
  "example_query": "tech gadgets + compare via reviews/features/cost",
  "tools": [
    "shimmer_daily",
    "GiftTool",
    "ProductSearch",
    "Review",
    "ProductComparison"
  ],
  "train_queries": [
    "What are some unique Father's Day gift recommendations?",
    "Can you compare various Father's Day gift options?",
    "Where can I find reviews for popular Father's Day gifts?",
    "What are some budget-friendly ideas for Father's Day presents?",
    "Could you suggest personalized gifts suitable for Father's Day?",
    "What are the top-rated gadgets as Father's Day gifts?",
    "How do I choose between these two Father's Day gift options?",
    "Are there any eco-friendly Father's Day gift alternatives?",
    "Could you list gifts appropriate for a first-time father?",
    "What are the trending Father's Day gifts this year?",
    "What are some popular Father's Day gift ideas for this year?",
    "Can you compare different smartwatch models suitable as Father's Day gifts?",
    "Where can I find reviews for affordable Father's Day gifts?",
    "Suggest unique and personalized gifts for Father's Day.",
    "What are the best online stores to purchase Father's Day presents?",
    "Could you recommend some eco-friendly Father's Day gift options?",
    "How do the features of top-tier Father's Day gifts compare?",
    "Are there any discounts available on Father's Day gifts currently?",
    "Can you help me find a high-quality grooming kit for Father's Day?",
    "What are some innovative tech gadgets that make great Father's Day gifts?",
    "What are the top recommended gifts for Father's Day?",
    "How can I compare various Father's Day gift options?",
    "Find reviews for popular Father's Day gifts in 2023.",
    "Suggest personalized gift ideas suitable for Father's Day.",
    "Which gadgets are highly rated as Father's Day presents?",
    "Are there affordable luxury items ideal for Father's Day?",
    "Can you help me choose between two Father's Day gift options?",
    "Provide insights on customer feedback for Father's Day gifts.",
    "Is there a list of trending Father's Day gift products this year?",
    "What are some recommended gifts for Father's Day this year?",
    "Can you compare popular Father's Day gift options in various price ranges?",
    "Which are the best-reviewed Father's Day gifts for tech-savvy dads?",
    "Could you suggest unique and personalized gifts suitable for Father's Day?",
    "Where can I find a comprehensive review of Father's Day gift items?",
    "Can you provide a list of affordable yet meaningful gifts for Father's Day?",
    "What are the latest trends in Father's Day gifting for 2023?",
    "How do different brands rate in terms of quality for Father's Day gifts?",
    "Are there any promotional deals currently available for Father's Day presents?",
    "What are some eco-friendly and sustainable gift ideas for Father's Day?",
    "What are some unique Father's Day gift ideas for 2023?",
    "Can you recommend gifts suitable for a tech-savvy dad?",
    "How do different grill models compare for Father's Day?",
    "Where can I find reviews for the latest smartwatches?",
    "What are the top-rated books as Father's Day gifts?",
    "Can you suggest affordable yet meaningful gift options?",
    "What are some personalized gift ideas for dads?",
    "Are there any discounts available on Father's Day gift bundles?",
    "Which brands offer the best quality in men's grooming kits?",
    "Can you help me find a gift for an outdoors-loving father?",
    "What are some popular gift ideas for Father's Day?",
    "Can you recommend a unique Father's Day gift for a tech enthusiast?",
    "Where can I find reviews for top-rated Father's Day presents?",
    "How does this wristwatch compare to others as a Father's Day gift?",
    "Which Father's Day gifts are suitable for a golfer?",
    "Are there budget-friendly options for Father's Day gifts?",
    "What are some personalized gift ideas for Father's Day?",
    "Can you suggest a gift that includes both practicality and sentimentality for Father's Day?",
    "Is there a guide to selecting the perfect Father's Day gift?",
    "What are the trending gifts for Father's Day this year?",
    "What are some thoughtful gift ideas for Father's Day?",
    "Can you suggest a unique gadget gift for my dad?",
    "Are there online reviews for popular Father's Day gifts?",
    "How do different tools compare for finding Father's Day gifts?",
    "What are the top-rated gifts for fathers this year?",
    "Can you recommend an affordable yet meaningful gift for my dad?",
    "What options are available for personalized Father's Day presents?",
    "Could you compare prices for high-quality Father's Day gift baskets?",
    "Which products are trending as Father's Day gifts in 2023?",
    "What do reviewers say about the newest smartwatches as gifts for dads?",
    "What are some unique gift ideas for Father's Day this year?",
    "Can you provide reviews of popular Father's Day gifts?",
    "How do different barbecue grill models compare as Father's Day gifts?",
    "Recommend a budget-friendly gadget as a Father's Day present.",
    "What are the top-rated personalized gifts for Father's Day?",
    "Are there any discounts available for Father's Day gift purchases?",
    "Which tool is best to find reviews for Father's Day gift items?",
    "Can you compare features of smartwatches as gifts for dads?",
    "Suggest a gift for a father who loves outdoor activities.",
    "Where can I find detailed reviews of Father's Day gift baskets?",
    "What are some unique Father's Day gift ideas this year?",
    "Can you recommend affordable yet thoughtful gifts for Father's Day?",
    "Which products are trending for Father's Day gifts currently?",
    "Where can I find reviews for popular Father's Day gift items?",
    "How do I compare different tools for selecting Father's Day gifts?",
    "What are some personalized gift options for Father's Day?",
    "Can you list eco-friendly gift ideas suitable for Father's Day?",
    "How can I choose the best gadget for a tech-savvy dad?",
    "Are there any recommended stores for Father's Day shopping?",
    "What are thoughtful gift ideas for a dad who enjoys sports?",
    "What are some thoughtful gifts for Father's Day?",
    "Can you recommend popular Father's Day presents?",
    "Where can I find reviews of top-rated Father's Day gifts?",
    "What are the best options to compare for Father's Day gift ideas?",
    "Are there unique and personalized gifts for Father's Day?",
    "How do I choose an appropriate gift for Father's Day?",
    "Which stores have great deals on Father's Day gifts this year?",
    "Can you provide a list of eco-friendly gifts for Father's Day?",
    "What are the trending tech gadgets suitable as Father's Day presents?",
    "How do different gift options for Father's Day compare in terms of price and quality?",
    "What are the top recommended Father's Day gifts this year?"
  ],
  "test_queries": [
    "Can you suggest unique gift ideas for Father's Day?",
    "How do I compare different gift options for Father's Day?",
    "Are there reviews available for popular Father's Day gifts?",
    "What is the best gift for a father who enjoys outdoor activities?",
    "Could you find a budget-friendly yet meaningful gift idea for Father's Day?",
    "How do various tech gadgets compare as Father's Day gifts?",
    "Can you recommend gifts that suit a father's hobbies and interests?",
    "Are there user reviews for premium Father's Day gift items?",
    "What are some recommended Father's Day gifts for this year?",
    "Can you compare the top-rated products suitable for Father's Day?",
    "Are there reviews available for the newest gadgets as Father's Day presents?",
    "Which is the best tool to find unique Father's Day gift ideas?",
    "How do I choose between personalized gifts for Father's Day?",
    "What are the pros and cons of gifting electronics for Father's Day?",
    "Can you suggest budget-friendly gift options for Father's Day?",
    "What are the most popular gifts chosen for Father's Day this decade?",
    "How can I find reviews for luxury items as Father's Day gifts?",
    "What are some creative DIY ideas for Father's Day presents?",
    "What are some recommended Father's Day gifts for a tech-savvy dad?",
    "Can you compare top-rated Father's Day gifts across different categories?",
    "Find reviews for popular Father's Day gift items.",
    "Suggest unique gift ideas for Father's Day celebration.",
    "Which gifts are best suited for a dad who loves sports?",
    "Locate a detailed product comparison of grilling equipment for Father's Day.",
    "Provide ratings and user feedback for personalized Father's Day gifts.",
    "Are there any trending gadgets that make great Father's Day presents?",
    "Help me choose between two options for a Father's Day gift.",
    "Explain the benefits of giving a subscription service as a Father's Day gift.",
    "Can you recommend tech gadgets suitable as gifts for Father's Day?",
    "Please compare prices of popular sports equipment for Father's Day gifting.",
    "What are the top-reviewed items in the Father's Day gift category?",
    "Find gifts for Father's Day under $50 that are highly rated.",
    "Are there any personalized gift options for Father's Day?",
    "What are the latest trends in Father's Day presents?",
    "Can you provide a list of eco-friendly Father's Day gift ideas?",
    "How do these two Father's Day gift options compare in quality and price?",
    "Are there any discounts available on Father's Day gifts this week?",
    "Can you suggest unique Father's Day presents for a sports enthusiast?",
    "Which Father's Day gifts are trending currently according to popular reviews?",
    "Please provide a comparison of smartwatch models suitable as Father's Day gifts.",
    "Are there any budget-friendly Father's Day gift options available?",
    "Could you help me choose between two specific gift ideas for Father's Day?",
    "Can you find reviews for grilling equipment ideal as Father's Day presents?",
    "How do different online stores compare in terms of Father's Day gift selections?",
    "What are the top-rated tech gadgets for Father's Day gifts?",
    "What are some recommended gifts for Father's Day?",
    "How can I compare different Father's Day gift options?",
    "What are the top-reviewed gifts for Father's Day this year?",
    "Where can I find affordable yet meaningful gifts for Father's Day?",
    "What are the latest trends in Father's Day gifts?"
  ]
}