{
  "task_name": "Space images",
  "meta_tool": "Space images",
  "example_query": "Find me high-resolution pictures of Saturn's rings",
  "tools": [
    "stellarexplorer",
    "NASATool",
    "SceneXplain",
    "ImageSearch",
    "jini"
  ],
  "train_queries": [
    "Can you explore stellar phenomena using the stellarexplorer tool?",
    "How can NASATool assist in analyzing images of nebulae?",
    "I need detailed explanations of planetary surface images; which tool is suitable?",
    "Find high-resolution pictures of distant galaxies using ImageSearch.",
    "Explain the significance of features in this space image with SceneXplain.",
    "What are the capabilities of jini in categorizing celestial photographs?",
    "Provide a list of tools for researching astronomical images.",
    "Can SceneXplain clarify the contents of this image from a space telescope?",
    "How would NASATool be employed to study exoplanetary atmospheres?",
    "Suggest an approach to locate images of the Milky Way galaxy.",
    "Search for images of nebulae captured by the Hubble Space Telescope.",
    "Explain the features of the Andromeda Galaxy through annotated images.",
    "Provide satellite images of Earth at night showing city light patterns.",
    "Locate high-resolution photos of the Mars surface taken by the Perseverance Rover.",
    "Explore artistic renderings of hypothetical exoplanetary environments.",
    "Identify images showcasing the stages of a solar eclipse.",
    "Discover photographs of the International Space Station from Earth's perspective.",
    "Analyze pictures illustrating the formation of a supernova.",
    "Access comparative visuals of planetary surfaces within our Solar System.",
    "Retrieve historic images from the Apollo lunar missions.",
    "Find high-resolution images of the Andromeda galaxy.",
    "Explain the features visible in the latest Hubble telescope image.",
    "Search for artistic renderings of exoplanetary systems.",
    "Show me the most recent photographs taken by the James Webb Space Telescope.",
    "Locate detailed images of the lunar surface.",
    "Provide visual comparisons between Earth and Mars.",
    "Access the image database for the Cassini spacecraft.",
    "Identify deep-space images with high contrast and clarity.",
    "Retrieve annotated satellite images of the polar ice caps.",
    "Find pictures of rare celestial events, such as supernovae.",
    "Show me high-resolution images of the Andromeda Galaxy.",
    "Can I find detailed space photographs of the Orion Nebula?",
    "Search for pictures of Mars' surface taken by the latest rovers.",
    "Provide astronomical images captured by the Hubble Space Telescope.",
    "Locate space visuals depicting the formation of stars.",
    "Find images illustrating the Milky Way galaxy as seen from Earth.",
    "Retrieve artistic renderings based on real cosmic events.",
    "Display infrared space photographs revealing hidden celestial structures.",
    "Identify historical space images from past Apollo missions.",
    "Give me a collection of space-themed wallpapers.",
    "Can I find recent satellite photos of Mars' surface?",
    "What are some images of nebulae captured by NASA's telescopes?",
    "Locate pictures of exoplanets discovered recently.",
    "Provide visuals of the Milky Way from Earth-based observatories.",
    "Search for artistic renderings of black holes based on scientific data.",
    "Are there any detailed photos of the moon's craters taken during Apollo missions?",
    "Display images comparing the size of planets in our solar system.",
    "Find landscapes of Earth taken from the International Space Station.",
    "What are some ultraviolet spectrum images of the sun?",
    "Can you show me high-resolution images of the Andromeda galaxy?",
    "What tools are available to analyze space photographs?",
    "Find images of the latest Mars rover missions.",
    "How do I access detailed satellite imagery of Earth?",
    "Explain the contents of this uploaded image of a nebula.",
    "Locate photos of exoplanets discovered recently.",
    "What resources can identify celestial bodies in telescope photos?",
    "Provide examples of artistic renderings of black holes.",
    "Are there available pictures from the Hubble Space Telescope archives?",
    "Help me search for specific constellations in astronomical datasets.",
    "Can you assist me in finding high-resolution images of celestial objects?",
    "What tools are available for explaining the details in space images?",
    "Where can I explore detailed photographs of planetary surfaces?",
    "Are there any resources to search for specific constellations in images?",
    "Could you guide me to a tool for analyzing astronomical photographs?",
    "I need assistance with locating images captured by the Hubble Telescope.",
    "How can I identify and label features in photos of the night sky?",
    "What platform offers a library of space exploration imagery?",
    "Can I retrieve visuals from recent Mars rover missions?",
    "What options exist for searching and interpreting satellite images of Earth?",
    "Find high-resolution space images showcasing nebulas.",
    "Retrieve recent NASA space photos and explain their significance.",
    "Discover images related to planetary surfaces.",
    "Can you provide detailed visuals of star systems?",
    "Search for artistic depictions of the Milky Way galaxy.",
    "Locate images taken from the International Space Station.",
    "Download satellite imagery of Earth's atmosphere.",
    "Provide annotated pictures of black holes and their surrounding areas.",
    "Look up space phenomena captured during solar eclipses.",
    "Search for educational images illustrating the concept of gravity in space.",
    "Find recent satellite images of Earth at night.",
    "Explain the details of the Orion Nebula seen in this image.",
    "Search for pictures of Martian landscapes captured by rovers.",
    "What are some close-up images of Saturn's rings?",
    "Locate images depicting the Apollo 11 moon landing.",
    "Provide annotated images of the Milky Way galaxy.",
    "Can you identify the celestial body in this photograph?",
    "Retrieve artistic representations of black holes.",
    "List photos showcasing the International Space Station in orbit.",
    "Can I access high-resolution photographs of the Andromeda Galaxy?",
    "What tools provide detailed descriptions for space-related images?",
    "Retrieve images of celestial bodies captured by the Hubble Space Telescope.",
    "I need a collection of Mars surface pictures for research purposes.",
    "Which platform can explain the content of astronomical photos?",
    "Search for images showing solar flares and their description.",
    "Find historical satellite images of Earth from the past decade.",
    "Request detailed imagery of exoplanets discovered recently.",
    "How can I obtain annotated pictures of the International Space Station?",
    "Provide photographs of nebulae along with their scientific annotations.",
    "Show me high-resolution images of distant galaxies captured by space telescopes.",
    "What are the latest images taken by the Hubble Space Telescope?"
  ],
  "test_queries": [
    "Can you find space-themed wallpapers for a computer background?",
    "Provide images depicting the surface of Mars from recent missions.",
    "Locate pictures of black holes and their surrounding areas.",
    "Are there any photos of the International Space Station taken from space?",
    "I need detailed visuals of Saturn's rings for a presentation.",
    "Search for artistic representations of space phenomena like nebulae.",
    "Find historical images of the Moon landing missions.",
    "Display comparative images of Earth from space over the years.",
    "Can you provide high-resolution images of distant galaxies?",
    "Show me pictures of the solar system's planets.",
    "Upload recent satellite images of Earth's surface.",
    "Find images depicting stars in various stages of their life cycle.",
    "Do you have artistic renditions of black holes?",
    "Retrieve historical photographs from the Hubble Space Telescope.",
    "Locate images of space missions and astronauts in action.",
    "Can you display nebulae with detailed annotations?",
    "Find comparative images of the Milky Way and neighboring galaxies.",
    "Search for pictures of meteor showers taken from space.",
    "Can you find recent photographs taken by the Hubble Telescope?",
    "What are the most detailed pictures of the surface of Mars?",
    "Locate space-themed wallpapers suitable for desktop use.",
    "Provide artistic renderings or interpretations of black holes.",
    "Search for images displaying planetary alignments.",
    "Identify photographs from the James Webb Space Telescope of distant stars.",
    "Retrieve educational charts or diagrams depicting the Milky Way.",
    "Look for satellite imagery of Earth’s polar regions from space.",
    "Find images showcasing the 1969 Apollo 11 moon landing.",
    "Show me images of galaxies captured by the Hubble Space Telescope.",
    "What are some high-resolution photos of Mars available?",
    "Can you provide artistic renderings of exoplanets?",
    "I need lunar surface imagery for scientific study.",
    "Find pictures of the Milky Way taken from Earth.",
    "Locate Saturn's ring details captured by space probes.",
    "Provide infrared images of nebulae in deep space.",
    "Are there any satellite photos of Earth during nighttime?",
    "Explore space station views of atmospheric phenomena.",
    "Retrieve archival images of the Apollo moon landing.",
    "Show me high-resolution images of Mars taken by recent missions.",
    "What are some iconic space photos captured by the Hubble Telescope?",
    "Can you display satellite imagery of Earth at night?",
    "Find pictures of exoplanets discovered in the last decade.",
    "Provide detailed images of the surface of the Moon.",
    "Search for photographs of nebulae with detailed annotations.",
    "Are there visuals of the International Space Station from outer space?",
    "Locate artistic interpretations of galaxies based on actual data.",
    "Fetch images depicting the formation of stars in the Milky Way.",
    "Display comparative pictures of different planets in our solar system.",
    "Show me high-resolution images of galaxies taken by NASA telescopes.",
    "Find pictures of the Milky Way and provide detailed explanations of the scenes.",
    "Search for recent space exploration photos and highlight notable features."
  ]
}