{
  "task_name": "Travel itinerary + booking + recommendations",
  "meta_tool": "Travel itinerary + booking + recommendations",
  "example_query": "California coast road trip plan",
  "tools": [
    "TripTool",
    "TripAdviceTool",
    "RestaurantBookingTool",
    "local"
  ],
  "train_queries": [
    "What are some recommended travel itineraries for a week-long trip to Japan?",
    "Can you help me book accommodations and plan activities for a family vacation in Paris?",
    "Suggest some local dining options in Rome and help me reserve a table.",
    "How can I organize a multi-city European tour, including transport and stay arrangements?",
    "Are there any cultural sites in Kyoto that I should include in my travel plan?",
    "Please assist me in finding the best flight deals to New York and a cozy hotel nearby.",
    "What are the top-rated restaurants in Barcelona, and how do I secure a booking?",
    "Help me design a relaxing beach holiday itinerary for the Maldives, including spa appointments.",
    "I need guidance on planning a budget-friendly trip to Bangkok with complete bookings.",
    "Can you recommend and book outdoor adventure activities in New Zealand for my vacation?",
    "Can you help me create a detailed travel itinerary for my upcoming vacation?",
    "I'd like recommendations for must-visit places in Paris and assistance with bookings.",
    "What are the best restaurants to dine at in New York, and can you book a table for me?",
    "I'm planning a weekend getaway; could you suggest activities and handle the reservations?",
    "Could you organize a family trip itinerary, including accommodation and transportation arrangements?",
    "Can you recommend and book unique experiences for a solo traveler in Japan?",
    "What are the top-rated tour packages for exploring the Grand Canyon?",
    "I need assistance planning a business trip, including flights, hotels, and meeting locations.",
    "Could you find and book a romantic dinner spot in Rome for an anniversary celebration?",
    "I'm interested in cultural landmarks in India; can you provide a travel plan and book tickets?",
    "What are the best options for a week-long getaway to Italy, including accommodations and activities?",
    "Can you recommend a unique travel destination suitable for a family of four and assist with the bookings?",
    "I need help planning a two-week cultural exploration in Japan—could you provide suggestions and arrange travel?",
    "Where can I find the most suitable restaurants in Paris? Please book a table for two as well.",
    "Can you organize a weekend trip to a nearby city with recommendations for places to visit and stay?",
    "I am looking for an adventurous holiday package in South America—can you assist with planning and reservations?",
    "What are the top-rated resorts in the Maldives, and can you secure a reservation for next month?",
    "Can you recommend a scenic road trip route in the USA and suggest accommodations along the way?",
    "I need assistance in booking flights, hotels, and activities for a business trip to Singapore.",
    "Can you compile a list of must-visit attractions in New Zealand, including dining options, and help book suitable accommodations?",
    "Can you help me plan a week-long trip to Italy, including flights, accommodations, and sightseeing suggestions?",
    "What are the best restaurants to dine at in Paris for a romantic evening?",
    "I'm looking to book a hotel in Tokyo near major attractions; any recommendations?",
    "Could you provide a detailed itinerary for a three-day visit to New York City?",
    "What are some family-friendly activities to do in Orlando, Florida?",
    "How do I arrange transportation and lodging for a business trip to Berlin?",
    "Can you find and book a guided tour of the Grand Canyon?",
    "What are the top-rated beaches to visit in Hawaii?",
    "Could you recommend and reserve a table at a vegan restaurant in San Francisco?",
    "I'm interested in adventure sports. Can you suggest a travel package for such activities in New Zealand?",
    "What are some recommended travel destinations for a week-long vacation?",
    "Can you help me book a hotel and activities in Paris for next month?",
    "What is the best itinerary for visiting historical landmarks in Rome?",
    "Please suggest a few popular restaurants in Tokyo and help reserve a table.",
    "How can I plan a family-friendly trip to the Grand Canyon?",
    "Find flights and accommodation for a business trip to New York City.",
    "What are some top-rated beaches in the Caribbean for a romantic getaway?",
    "Help me organize a multi-city European tour, including transportation and lodging.",
    "Can you provide recommendations for local attractions in Sydney?",
    "I need assistance planning a budget-friendly weekend trip to San Francisco.",
    "Can you help me plan a weeklong trip to Spain, including flights, accommodations, and must-visit destinations?",
    "I'd like recommendations for a road trip itinerary across the western United States.",
    "Could you assist in booking a romantic dinner for two in Paris during our vacation?",
    "What are some top-rated activities to do in Tokyo for a first-time visitor?",
    "Please suggest a family-friendly travel plan for exploring Italy.",
    "How can I secure tickets and accommodations for a weekend getaway in New York City?",
    "Can you propose an itinerary for a cultural exploration of Southeast Asia?",
    "What are the best tools to find flights and hotels for a business trip to London?",
    "Could you recommend a three-day itinerary for visiting historical landmarks in Rome?",
    "I'd like to know about scenic train routes in Switzerland and their booking procedures.",
    "Can you help me plan a week-long vacation in Italy, including flights, accommodations, and key attractions?",
    "What are the top-rated restaurants in Kyoto, and can you reserve a table for two at one of them?",
    "I'm looking for an adventurous itinerary in Costa Rica, focusing on eco-tourism and outdoor activities.",
    "Could you suggest a two-day trip itinerary for Paris, including historical landmarks and local cuisine?",
    "Find and book the best available flights and hotels for a five-day business trip to New York City.",
    "What are some recommended travel destinations for a family with young children, and can you plan a trip for us?",
    "Please create a romantic getaway plan for a couple, including spa visits and dining experiences.",
    "I want to explore Southeast Asia for two weeks; could you suggest a route and book accommodations?",
    "Can you organize a group tour for ten people in Spain, including transport and guided tours?",
    "What are the best travel deals currently available for a solo traveler to Australia?",
    "Can you help me plan a week-long trip to Italy, including accommodations and transportation?",
    "What are the best restaurants to try in Paris, and can you book a table for two?",
    "I need a three-day itinerary for Tokyo with recommendations for must-see attractions.",
    "Can you suggest a family-friendly trip destination and arrange the bookings?",
    "What are the current best travel deals for a solo traveler to Bali?",
    "Can you design a cultural tour itinerary for Kyoto with a focus on traditional experiences?",
    "I’m looking for a weekend getaway near New York City—any suggestions and booking options?",
    "What’s the best way to explore Rome in four days, including local dining spots?",
    "Can you recommend a luxury resort in the Maldives and arrange the reservation?",
    "I’d like to plan a road trip across California—what stops should I include and where to stay?",
    "What is the ideal travel itinerary for a week-long vacation in Italy?",
    "Could you recommend the top activities to do in Tokyo for a first-time visitor?",
    "I need assistance booking flights and accommodations for a family trip to Paris.",
    "What are the best restaurants to dine at in New York City, and can you make reservations?",
    "Plan a three-day itinerary for visiting the Grand Canyon and nearby attractions.",
    "How can I book tickets for a guided tour in London?",
    "What are the most picturesque locations to visit in Bali for photography enthusiasts?",
    "Can you suggest a route for a road trip across the southern United States?",
    "Please help me plan a honeymoon trip to the Maldives, including resorts and activities.",
    "What are the essential travel tips and recommendations for exploring Australia?",
    "Can you help me organize a 5-day itinerary for Paris?",
    "What are some recommended restaurants in New York that I can book in advance?",
    "I need assistance with planning a road trip across California, including accommodation and activities.",
    "Could you suggest a family-friendly vacation destination in Europe with booking details?",
    "What are the top attractions to visit in Tokyo, and how can I book tickets for them?",
    "Please recommend a romantic getaway for a weekend, including booking options for a cozy hotel.",
    "I am looking for an itinerary for exploring historical landmarks in Rome for a week.",
    "How can I reserve a table at a Michelin-starred restaurant in London?",
    "Could you provide a list of must-visit beaches in Thailand along with nearby accommodations?",
    "I’d like assistance in planning a group hiking trip in the Rockies, including permits and camping sites."
  ],
  "test_queries": [
    "Can you help me plan a week-long trip to Italy, including flights, accommodations, and sightseeing tours?",
    "I'm looking for restaurant recommendations and reservations in Paris for a romantic dinner.",
    "What are the best options for a family-friendly vacation in Florida during the summer?",
    "Can you book a train ticket and suggest activities in Kyoto for a day trip?",
    "I'd like a customized itinerary for a road trip along the California coast.",
    "What are the top-rated hotels in New York City within a budget of $200 per night?",
    "Can you find flights from London to Sydney with the shortest layover times?",
    "Suggest a weekend getaway destination within three hours' drive from my current location.",
    "I'm planning a hiking trip in the Swiss Alps; what are the best trails and nearby lodgings?",
    "What are some must-visit attractions and dining spots in Tokyo for a food enthusiast?",
    "Can you help me plan a two-week itinerary for a trip to Italy?",
    "What are some recommended restaurants in Paris and how can I book a table?",
    "Could you assist in finding and booking a hotel near the beach in Hawaii?",
    "I need suggestions for family-friendly attractions in Orlando.",
    "Can you provide a detailed travel plan for a weekend getaway to New York City?",
    "What are the top-rated activities to explore in Tokyo?",
    "How can I efficiently book flights and accommodations for a business trip to London?",
    "I'd like to organize a culinary tour in Thailand. Can you recommend options?",
    "Can you create a travel itinerary for exploring the historical landmarks in Greece?",
    "What are some budget-friendly travel recommendations for backpacking through South America?",
    "Can you help me plan a travel itinerary with bookings and recommendations?",
    "I need some advice on organizing a trip, including places to visit and reservations.",
    "What are the best options for a week-long vacation with accommodation suggestions?",
    "Could you assist in creating a comprehensive travel schedule with dining recommendations?",
    "What resources can I use to arrange a holiday trip, covering all necessary bookings?",
    "I'm looking for tips to plan a weekend getaway, including local attractions and restaurants.",
    "Would you recommend any specific tools to plan a 10-day trip itinerary?",
    "How can I efficiently book flights, hotels, and activities for an upcoming vacation?",
    "Can you provide a detailed travel plan with cost-effective booking options?",
    "What are some must-visit places and best dining spots for a city tour?",
    "Can you help me plan a week-long vacation and suggest activities for each day?",
    "What are some top-rated hotels to consider for my upcoming trip?",
    "I'd like to book a table at a cozy restaurant during my weekend getaway.",
    "Provide recommendations for sightseeing in Paris and nearby areas.",
    "Can you create a detailed travel itinerary for a road trip across the USA?",
    "I'd like to find family-friendly attractions in Tokyo for our summer holiday.",
    "Which tools can assist in booking accommodations and tours for my trip?",
    "Can you recommend destinations for a relaxing beach vacation?",
    "Plan a day-to-day schedule for exploring the cultural sites of Rome.",
    "Help me organize a group tour including transport and meal reservations.",
    "Can you help me plan a travel itinerary for a week-long vacation in Italy, including booking accommodations and suggesting activities?",
    "What are some recommended places to visit in Japan, and can you assist in arranging the travel bookings?",
    "I’m planning a weekend getaway in New York City. Could you provide a detailed itinerary and book a fine dining experience?",
    "Could you suggest a travel plan for a family trip to Paris, including hotel reservations and kid-friendly activities?",
    "What are the top attractions in Sydney, and how can I book a guided tour for them?",
    "I want a relaxing beach vacation in Hawaii. Can you help plan the trip and recommend some great local restaurants?",
    "Could you provide a two-week travel itinerary for exploring Spain, including transportation and accommodation arrangements?",
    "What are the best hiking destinations in Switzerland, and can you assist with booking overnight stays along the trails?",
    "I need assistance in organizing a cultural exploration trip in India. Can you suggest a route and book visits to historical sites?",
    "Can you plan a romantic getaway for two in Bali, ensuring all accommodations and special dinners are arranged?"
  ]
}